<div class="row">
        <div class="col-lg-9">
            <h1>1159.Market Analysis II</h1>
            <div class="markdown-body" style="margin-top: 20px">
                <p>Table: <code>Users</code></p>

<pre>
+----------------+---------+
| Column Name    | Type    |
+----------------+---------+
| user_id        | int     |
| join_date      | date    |
| favorite_brand | varchar |
+----------------+---------+
user_id is the primary key of this table.
This table has the info of the users of an online shopping website where users can sell and buy items.</pre>

<p>Table: <code>Orders</code></p>

<pre>
+---------------+---------+
| Column Name   | Type    |
+---------------+---------+
| order_id      | int     |
| order_date    | date    |
| item_id       | int     |
| buyer_id      | int     |
| seller_id     | int     |
+---------------+---------+
order_id is the primary key of this table.
item_id is a foreign key to the Items table.
buyer_id and seller_id are foreign keys to the Users table.
</pre>

<p>Table: <code>Items</code></p>

<pre>
+---------------+---------+
| Column Name   | Type    |
+---------------+---------+
| item_id       | int     |
| item_brand    | varchar |
+---------------+---------+
item_id is the primary key of this table.
</pre>

<p>&nbsp;</p>

<p>Write an SQL query to find for each user, whether the brand of the second item (by date) they sold&nbsp;is&nbsp;their favorite brand. If a user sold less than two items, report the answer&nbsp;for that user as no.</p>

<p>It is guaranteed that no seller sold more than one item on a day.</p>

<p>The query result format is in the following example:</p>

<pre>
Users table:
+---------+------------+----------------+
| user_id | join_date  | favorite_brand |
+---------+------------+----------------+
| 1       | 2019-01-01 | Lenovo         |
| 2       | 2019-02-09 | Samsung        |
| 3       | 2019-01-19 | LG             |
| 4       | 2019-05-21 | HP             |
+---------+------------+----------------+

Orders table:
+----------+------------+---------+----------+-----------+
| order_id | order_date | item_id | buyer_id | seller_id |
+----------+------------+---------+----------+-----------+
| 1        | 2019-08-01 | 4       | 1        | 2         |
| 2        | 2019-08-02 | 2       | 1        | 3         |
| 3        | 2019-08-03 | 3       | 2        | 3         |
| 4        | 2019-08-04 | 1       | 4        | 2         |
| 5        | 2019-08-04 | 1       | 3        | 4         |
| 6        | 2019-08-05 | 2       | 2        | 4         |
+----------+------------+---------+----------+-----------+

Items table:
+---------+------------+
| item_id | item_brand |
+---------+------------+
| 1       | Samsung    |
| 2       | Lenovo     |
| 3       | LG         |
| 4       | HP         |
+---------+------------+

Result table:
+-----------+--------------------+
| seller_id | 2nd_item_fav_brand |
+-----------+--------------------+
| 1         | no                 |
| 2         | yes                |
| 3         | yes                |
| 4         | no                 |
+-----------+--------------------+

The answer for the user with id 1 is no because they sold nothing.
The answer for the users with id 2 and 3 is yes because the brands of their second sold items are their favorite brands.
The answer for the user with id 4 is no because the brand of their second sold item is not their favorite brand.</pre>

In [1]:
import sqlalchemy
import pandas as pd
engine = sqlalchemy.create_engine('mysql+mysqlconnector://root:newpass_1234@localhost:3306/sys')

In [2]:
Users1159 = pd.read_sql_table("Users1159", engine)
Users1159

   user_id  join_date favorite_brand
0        1 2019-01-01         Lenovo
1        2 2019-02-09        Samsung
2        3 2019-01-19             LG
3        4 2019-05-21             HP

In [3]:
Orders1159 = pd.read_sql_table("Orders1159", engine)
Orders1159

   order_id order_date  item_id  buyer_id  seller_id
0         1 2019-08-01        4         1          2
1         2 2019-08-02        2         1          3
2         3 2019-08-03        3         2          3
3         4 2019-08-04        1         4          2
4         5 2019-08-04        1         3          4
5         6 2019-08-05        2         2          4

In [4]:
Items1159 = pd.read_sql_table("Items1159", engine)
Items1159

   item_id item_brand
0        1    Samsung
1        2     Lenovo
2        3         LG
3        4         HP

In [5]:
query = '''
WITH summary_tab AS(
SELECT o.*, i.item_brand,
       COUNT(o.item_id) OVER (PARTITION BY seller_id ORDER BY order_date) item_no
FROM Orders1159 o
LEFT JOIN Items1159 i
ON o.item_id = i.item_id)
SELECT u.user_id seller_id, 
       (CASE WHEN u.favorite_brand = s.item_brand THEN 'yes'
       ELSE 'no' END) 2nd_item_fav_brand 
FROM USERS1159 u
LEFT JOIN summary_tab s
ON u.user_id = s.seller_id
WHERE s.item_no = 2 OR s.item_no is null
ORDER BY seller_id
;
'''
pd.read_sql_query(query, engine)

   seller_id 2nd_item_fav_brand
0          1                 no
1          2                yes
2          3                yes
3          4                 no

Note:
1. Window Function did not support DISTINCT.